import React from 'react'
import { useBlogs } from "../../hooks/useBlogs";
import Image from 'next/image';

const idx = ({blog}:any) => {
    const [blogs] = useBlogs();
    const blogImg = require("../../assets/images/blog.png");

  return (
    <div className='container bg-white mx-auto'>
        <div>
        <Image
        src={blogImg}
            //   src={blog.img}
              alt="productsPhoto"
              width={400}
              height={200}
              className="rounded-lg object-fill  "
            />
        </div>
        <div>
            <h1>Гөлөгний нийгэмших явц</h1>
            <p>
            Нийгэмших явц гэдэг нь амьтныг сургаж , түүний нийгмийн хэлхээ холбоог хөгжүүлэх процесс юм. 3 сартайгаасаа гөлөгнүүд хүрээлэн байгаа бүх зүйлд татагдаж эхэлдэг. Энэ нь гөлөгтэй тааралдах амьд амьтан бүхэнд амархан дасах байдлаар нөлөөлдөг. Байгаль дээр энэ нь гөлөгний эх ба сүрэг юм. Энэ үеийг шинэ бүхэнд татагдах үе гэж нэрлэдэг.
             <br/>
            Гөлөгнүүд хүрээлэн буй орчноо судалж бага багаар хүрээгээ тэлдэг. Ингэхдээ үнэртэх хүртэх , тэмтрэх мэдрэмжээ ашиглана. Гөлөг шинэ бүх зүйлийг хазах дуртай. Ингээд бусад төрлийн амьд амьтадтай танилцана. Улмаар тэднийг дайсан биш нөхөрсөг найрсаг байдлаар үнэлэх болно. Иймээс гөлгийг тухайн гэр бүлийн том хүн ч бай өсвөр насны хүүхэд ч бай нялх хүүхэд ч ялгаагүй бүгдтэй нь танилцуулах нь маш чухал. Энэ үед түүнд зайлшгүй шаардлагатай нийгмийн харилцааны дадал (код)бий болох бөгөөд мөн шатлан захирах ёс тогтоно. Эдгээр кодоор эх нь гөлөгнүүдээ сургах ба үүнээс гадна нэг ихэрлээ төрцийн гөлөгнүүд хоорондоо тоглох , хоол хүнсээ идэх үед бий болж хөгждөг. Гөлөгнүүд захирагдаж, тайван байгаагаа илэрхийлдэг болно. Тоглож наадахдаа бусдыгаа уриалж, эсвэл аюул занал учирч байгааг илэрхийлж сурдаг.
            <br/>
            Эдгээр дадлыг эзэмшихэд олон зүйл эхээс нь шалтгаална. 3 долоо хогтойгоос Эх нохой гөлөгнүүдийг хөхөө хөхөж байхдаа болон тоглож байхдаа хаздаг хатуу ширүүн өвдөлтөд хариу үйлдэл үзүүлэлдэг. Ингэснээр гөлөгнүүд өөрсдөд нь ийм зүйл тохиолдход зөөлөн хаздаг болгодог. Тоглож байхдаа болон Эхтэйгээ харилцах харилцаагаар дамжуулан зайлшгүй шаардлагатай янз бүрийн төрх байдал , дуу авиа гаргаж сурна мөн эрүүний хазалтын хүчээ хянаж сурдаг . Гөлөгнүүд ноцолдон тоглож байхдаа бие биенээ хаздаг хэрэв аль нэг нь нөгөөгөө хүчтэй хазах юм бол тэр нь гасалж гийнадаг.
            <br/>
            Эх нь дундуур нь орж буруутанг шилэн хүзүүнээс нь зуугаад сэгсрээд буулгана. Ингэхэд гөлөг гонгинож захирагдаж байгаа төрхөө илэрхийлдэг. Ингэж эх нь ерөнхийд нь тэднийг үйл хөдлөлөө хянахад сургадаг. 5 долоо хоногтойгоос буюу Эхийг нь холдуулж эхлэхтэй зэрэгцэн "сонор сэрэмжтэй үе" эхэлнэ. Гөлөг аз туршихгүйн тулд өчүүхэн жаахан аюул тулгархад бэлэн байхын тулд байнга сонор соргог байж сурна. Энэ үе 12-16долоо хоног хүртэл үргэлжилнэ. Гөлөгнүүдийг нийгэмд биеээ авч явах дүрэмд сургах хамгийн тохиромжтой үе бол 3-7сартайн хоорондох хугацаа юм. Энэ анхлан нийгэмших процэсс нь тогтвортой сургалтанд хөтлөх бөгөөд бүх амьдралынх нь турш үргэлжилнэ. 
            <br/>
            Энэ үеийг "мэдрэмтгий үе" гэж нэрлэнэ. Энэ үед гаргасан бүх алдааг бараг л засах аргагүй. Нохой бүр бага наснаасаа сүрэгт баримталдаг дүрмийн дагуу өөрийн хүсэл сонирхлыг удирдаж , удирдуулж сурдаг учир гэр бүлдээ гөлөг сонгон авсан , авах гэж буй шинэ эзэд аль болох эхтэйгээ хамт өссөн вакцины 2 тун , туулгандаа хамрагдсан анхан шатны нийгэмшил эзэмшсэн гөлөг сонгохын сацуу гэршүүлэх процэсс гэж чухам юу вэ , амьтан хүн хоорондын болон ноход хоорондын харилцааны талаар мэдлэгтэй байх нь цаашдын нийгэмшилд илүү үр дүнтэй. 
            </p>
        </div>

    </div>
  )
}

export async function getStaticPaths() {
    const res = await fetch("https://lucky-paws-api.onrender.com/blog");
    const blogs = await res.json();
    const ids = blogs?.blog?.map((product: any) => product._id);
    const paths = ids.map((id: any) => ({ params: { id: id.toString() } }));
    return {
      paths: paths,
      fallback: true,
    };
  }
  
  export async function getStaticProps({ params }: any) {
    const res = await fetch(
      `https://lucky-paws-api.onrender.com/blog/${params.id}`
    );
    const data = await res.json();
    console.log("data:", data);
  
    return { props: { product: data.blog } };
  }

export default idx;